<h1 align="center">Pandas in python</h1> 

- **Pandas is a open source library built on top of numpy.**
- **It allows for fast analysis and data cleaning and preparation.**
- **It excels in performance and productivity.**
- **It also has built-in visualization features.**
- **It can work with data from wide variety of sources.**

In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/clecotech/.local/lib/python3.6/site-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/lib/python3/dist-packages (from pandas) (2018.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/clecotech/.local/lib/python3.6/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.7.3->pandas) (1.11.0)
Note: you may need to restart the kernel to use updated packages.

<h1 align="center">Series</h1> 

- **A Series is a one-dimensional array of data. It can hold data of any type: string, integer, float, dictionaries, lists, booleans, and more**

In [2]:
import pandas as pd
import numpy as np

###  # Series Creation - using different different data type.

In [3]:
label=["a","b","c"] #list of strings
data=[1,2,3] #list of numbers
d={"a":1,"b":2,"c":3} #dictionary
arr=np.array(data) #numpy array using list

In [4]:
pd.Series(label) #series using label list

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data) #series using data list

0    1
1    2
2    3
dtype: int64

In [6]:
pd.Series(d) #series using dictionary

a    1
b    2
c    3
dtype: int64

In [7]:
pd.Series(arr) #series using numpy array

0    1
1    2
2    3
dtype: int64

In [8]:
pd.Series(data=data, index=label) #series using data and label passed

a    1
b    2
c    3
dtype: int64

<div class="alert alert-block alert-warning">
<b>Important:</b> pandas Series can hold variety of object type. example given below !</div>

In [9]:
data=["s",1,2,2.2]
pd.Series(data)

0      s
1      1
2      2
3    2.2
dtype: object

###  # Accessing Series Element  - using different different data type.

<div class="alert alert-block alert-success">
<b>Note:</b> Pandas Series uses key value pair for fast lookups, it works like hashtable and dictionary.
</div>

In [10]:
series1= pd.Series([4,5,6,7,8] ,["a","s","d","f","g"])
series1

a    4
s    5
d    6
f    7
g    8
dtype: int64

In [11]:
series2= pd.Series([1,2,3,4,5] ,["z","x","d","f","g"])
series2

z    1
x    2
d    3
f    4
g    5
dtype: int64

In [12]:
series1["a"] # accessing element is same as dictionaries

4

In [13]:
series2["x"]

2

In [14]:
series1+series2 # basic operations

a     NaN
d     9.0
f    11.0
g    13.0
s     NaN
x     NaN
z     NaN
dtype: float64

<div class="alert alert-block alert-warning">
<b>Important:</b> Pandas and Numpy convert number to float in order to retain all the information.
</div>

<h1 align="center">DataFrames</h1> 

- A DataFrame is a two-dimensional, 
    - size-mutable, 
    - and heterogeneous tabular data structure in pandas, 
    - similar to a spreadsheet or SQL table

###  # DataFrame Creation

In [15]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [17]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #parameters are :data, index, column_name

In [19]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

###  # Indexing & Selection

In [20]:
df['W'] #getting column W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [21]:
type(df['W']) #type of column W

pandas.core.series.Series

In [22]:
type(df) #type of DataFrame

pandas.core.frame.DataFrame

In [23]:
 df.W #another way of indexing df.<column_name>

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [24]:
df[['W','Z']] #to get multiple columnS

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

<div class="alert alert-block alert-warning">
<b>Important:</b> If we call a single column we get Series and if we call multiple column we get DataFrame
</div>

- **Column addition in new column in DataFrame**

In [25]:
df['new']=df['W']+df['Z'] #adding column

In [26]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

- **Column deletion in df**

In [27]:
df.drop('new',1) #parameter: column_name='new',axis=1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [29]:
#original data is not affected as seen above

In [30]:
# pandas do this coz to avoid accident data deletion and ,
# to do we have to pass inplace=True parameter

In [31]:
df.drop('new',1,inplace=True)

In [32]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [33]:
df.drop('E') #no axis parameter required as by default axis=0

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [34]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [35]:
df.shape

(5, 4)

In [36]:
# it is just numpy array of size 5X4 so 5 is axis=0 and 4 is axis=1

In [37]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [38]:
df.loc['A'] #to access row A we use loc[<label>] label based selection

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [39]:
#rows are also Series

In [40]:
df.iloc[0] #to access row using numerical based index.

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [41]:
# getting single element
    
df.loc['A','W'] #row,column

0.3026654485851825

In [42]:
# subset printing

df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

- **Conditional data selection** 
                                                                                   - **Very Very Important**

In [43]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
df>0 # same as numpy arrays

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [45]:
booldf=df>0

In [46]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [47]:
df[df['W']>0] #outputs entire row where column W is true.

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [48]:
#to access only Y cloumn after condition 

df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [49]:
#to accesss multiple cloumns after filter we use [[<col1>, <col2>]]

df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [50]:
#using or and and operator

df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

<div class="alert alert-block alert-danger">
<b>Error:</b> We can't use 'and' and 'or' operator of python because 
    it can not perform operation between two series so instead 
    we use '|' for or and '&' for and operators.
</div>

- ### reset_index() - to reset index to a numerical value

In [51]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

- ### making a new column as index using set_index() method.

In [53]:
new_col=" AS SD DF GH HJ".split() #spliting string to list

In [54]:
df['new_col']=new_col #adding new_col to df

In [55]:
df

          W         X         Y         Z new_col
A  0.302665  1.693723 -1.706086 -1.159119      AS
B -0.134841  0.390528  0.166905  0.184502      SD
C  0.807706  0.072960  0.638787  0.329646      DF
D -0.497104 -0.754070 -0.943406  0.484752      GH
E -0.116773  1.901755  0.238127  1.996652      HJ

In [56]:
df.set_index('new_col') #set_index(<column name>)

                W         X         Y         Z
new_col
AS       0.302665  1.693723 -1.706086 -1.159119
SD      -0.134841  0.390528  0.166905  0.184502
DF       0.807706  0.072960  0.638787  0.329646
GH      -0.497104 -0.754070 -0.943406  0.484752
HJ      -0.116773  1.901755  0.238127  1.996652

<div class="alert alert-block alert-warning">
<b>Important:</b> set_index() vs reset_index() difference
</div>

###  # Multi Indexed DataFrame

In [57]:
outside=["G1", "G1", "G1", "G2", "G2", "G2"]
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
heir_index=pd.MultiIndex.from_tuples(heir_index)

In [58]:
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [59]:
df=pd.DataFrame(randn(6,2),heir_index,["A","B"])

In [60]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

###  # Accessing DataFrame elements.

In [61]:
df.loc["G1"] #using loc[]

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [62]:
df.loc["G1"].loc[1] #using loc[] then in loc[]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [63]:
df.loc["G1"].loc[1].loc["A"] #using loc[] then in loc[] then in loc[]

-0.993263499973366

**# Order to access element is Outside >> Inside >> In Inside.**

In [64]:
df.index.names

FrozenList([None, None])

In [65]:
df.index.names=["Groups","Num"]

In [66]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [67]:
df.loc["G1"].loc[2].loc["B"]

0.000366479605643592

In [68]:
# xs()function

df.xs(1,level="Num")

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

<h1 align="center">Missing Data</h1>

In [69]:
d={"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [70]:
df=pd.DataFrame(d)

In [71]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

###  # dropna() - to drop null values row and col.

In [72]:
df.dropna()  #axis=0

     A    B  C
0  1.0  5.0  1

In [73]:
df.dropna(axis=1) #axis=1

   C
0  1
1  2
2  3

In [74]:
df.dropna(thresh=2) #threshold parameter

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

###  # fillna() - to fill null values.

In [75]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
df.fillna(value="fill value") #to fill value in DataFrame

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [77]:
df["A"].fillna(value=df["A"].mean()) #to fill mean() in a desired row

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<h1 align="center">Groupby method</h1> 

- **groupby allows us to group together rows based off of a column and perform the aggregate function on them.**
<br>
- **aggregate function takes multiple values and outputs a single value as result**

In [78]:
data = {
    "company": ["abc", "abc", "google", "google", "amazon", "clecotech"],
    "sales": [14, 58, 69, 8, 9, 47],
    "person": ["ra", "hel", "fog", "hog", "my", "jar"]
}
df = pd.DataFrame(data)
df

     company  sales person
0        abc     14     ra
1        abc     58    hel
2     google     69    fog
3     google      8    hog
4     amazon      9     my
5  clecotech     47    jar

In [79]:
byComp=df.groupby("company")
byComp.mean()

           sales
company
abc         36.0
amazon       9.0
clecotech   47.0
google      38.5

In [80]:
byComp.sum()

           sales
company
abc           72
amazon         9
clecotech     47
google        77

In [81]:
byComp.std()

               sales
company
abc        31.112698
amazon           NaN
clecotech        NaN
google     43.133514

In [82]:
byComp.sum().loc['abc']

sales    72
Name: abc, dtype: int64

In [83]:
df

     company  sales person
0        abc     14     ra
1        abc     58    hel
2     google     69    fog
3     google      8    hog
4     amazon      9     my
5  clecotech     47    jar

In [84]:
df.groupby("sales").sum()

         company person
sales
8         google    hog
9         amazon     my
14           abc     ra
47     clecotech    jar
58           abc    hel
69        google    fog

In [85]:
df.groupby("sales").sum().loc[8]

company    google
person        hog
Name: 8, dtype: object

In [86]:
df.groupby("sales").count()

       company  person
sales
8            1       1
9            1       1
14           1       1
47           1       1
58           1       1
69           1       1

In [87]:
df.groupby("company").describe()

          sales
          count  mean        std   min    25%   50%    75%   max
company
abc         2.0  36.0  31.112698  14.0  25.00  36.0  47.00  58.0
amazon      1.0   9.0        NaN   9.0   9.00   9.0   9.00   9.0
clecotech   1.0  47.0        NaN  47.0  47.00  47.0  47.00  47.0
google      2.0  38.5  43.133514   8.0  23.25  38.5  53.75  69.0


<div class="alert alert-block alert-success">
<b>describe():</b> The describe() method in pandas is used to generate descriptive statistics for numeric columns in a DataFrame. <br> It provides various statistics such as count, mean, standard deviation, minimum, maximum, and quartile values.
</div>

In [88]:
df.groupby("company").describe().transpose()

company            abc  amazon  clecotech     google
sales count   2.000000     1.0        1.0   2.000000
      mean   36.000000     9.0       47.0  38.500000
      std    31.112698     NaN        NaN  43.133514
      min    14.000000     9.0       47.0   8.000000
      25%    25.000000     9.0       47.0  23.250000
      50%    36.000000     9.0       47.0  38.500000
      75%    47.000000     9.0       47.0  53.750000
      max    58.000000     9.0       47.0  69.000000

In [89]:
df.groupby("company").describe().transpose()["clecotech"]

sales  count     1.0
       mean     47.0
       std       NaN
       min      47.0
       25%      47.0
       50%      47.0
       75%      47.0
       max      47.0
Name: clecotech, dtype: float64

**@notes by rajveer**

<h1 align="center">Merging Joining And Concatenation</h1> 

- **There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.**

In [90]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [91]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [92]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [93]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### # Concatenation


- Concatenation basically glues together DataFrames. 
- Keep in mind that dimensions should match along the axis you are concatenating on.
- We use **pd.concat()** and pass in a list of DataFrames to concatenate together

In [94]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [95]:
pd.concat([df1,df2,df3],axis=1) #on different axis

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### # Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together.

<div class="alert alert-block alert-warning">
<b>Important:</b> SQL Joins is used to join two tables on basis of a common field.<br>
    There are basic 4 types of joins:<br>
        <b>inner join </b>: Fethches matching records only.<br>
            <b>right join </b>: inner join + additional recods of right table.<br>
               <b> left join</b> : inner join + additional recods of left table.<br>
                   <b> outer join or full join</b>: inner join 
                        + all remaining record from left table 
                        + all remaining record from right table  
</div>

In [96]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [97]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [98]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [99]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [100]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [101]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [102]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [103]:
pd.merge(left,right,how='inner',on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [104]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [105]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [106]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [107]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### # Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [108]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [109]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [110]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [111]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [112]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

<h1 align="center">Operations</h1> 


- **There are lots of operations with pandas that will be really useful, but don't fall into any distinct category.**

In [113]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

#.

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

<div class="alert alert-block alert-success">

<b>head() method :</b> is used to display the first few rows of a DataFrame. By default, it shows the first 5 rows,
but you can specify the number of rows you want to display by passing an argument to the method.
</div>

### # Info on Unique Values

In [114]:
df['col2'].unique() 

#diplay unique values.

array([444, 555, 666])

In [115]:
df['col2'].nunique() 

#display number of unique values.

3

In [116]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

<div class="alert alert-block alert-success">

<b>value_counts() method :</b> in pandas is used to count the occurrences of unique values in a Series.
It returns a new Series where the unique values are the index labels and,
the corresponding values are the counts of each unique value in the original Series.
</div>

### # Selecting Data

In [117]:
#Select from DataFrame using criteria from multiple columns

newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

### # Applying Functions

In [118]:
def times2(x):
    return x*2

In [119]:
df['col1'].apply(times2) #applying function to the column

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [120]:
df['col3'].apply(len) #applying built-in methods()

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

- **Sum of Column**

In [121]:
df['col1'].sum() #sum of column

10

- **Permanently Removing a Column**

In [122]:
del df['col1']

In [123]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

- **Get column and index names:**

In [124]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [125]:
df.index

RangeIndex(start=0, stop=4, step=1)

- **Sorting and Ordering a DataFrame:**

In [126]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [127]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

- **Find Null Values or Check for Null Values**

In [128]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [129]:
# Drop rows with NaN Values

df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

- **pivot_table() function**

In [130]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [131]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [132]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN


<div class="alert alert-block alert-success">
<b>pivot_table() function  :</b> in pandas is used to create a spreadsheet-style pivot table as a DataFrame.

**@notes by rajveer**

<h1 align="center">Data Input and Output</h1> 

- **pandas can read a variety of file types using its pd.read_ methods**

### # CSV Input

In [133]:
df = pd.read_csv('example')
df

     company  sales person
0        abc     14     ra
1        abc     58    hel
2     google     69    fog
3     google      8    hog
4     amazon      9     my
5  clecotech     47    jar

### # CSV Output

In [134]:
df.to_csv('example',index=False)

### # Excel
**Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.**

- ### Excel Input

In [135]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

TypeError: read_excel() got an unexpected keyword argument 'sheetname'

- ### Excel Output

In [ ]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')